OFsolvers/tutorial_cases/pilot_1500L_Kla_validation_0.58vvm_42rpm/constant/momentumTransport.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;
RAS
{
  model  mixtureKEpsilon;
  turbulence  on;
  printCoeff  on;
}

// ************************************************************************* //
